###################################################################

# Created by write_sdc on Thu Dec 14 12:16:57 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 0
create_clock -name clk  -period 3.2e+08  -waveform {0 1.6e+08}
set_input_delay -clock clk  0  [get_ports {inp[63]}]
set_input_delay -clock clk  0  [get_ports {inp[62]}]
set_input_delay -clock clk  0  [get_ports {inp[61]}]
set_input_delay -clock clk  0  [get_ports {inp[60]}]
set_input_delay -clock clk  0  [get_ports {inp[59]}]
set_input_delay -clock clk  0  [get_ports {inp[58]}]
set_input_delay -clock clk  0  [get_ports {inp[57]}]
set_input_delay -clock clk  0  [get_ports {inp[56]}]
set_input_delay -clock clk  0  [get_ports {inp[55]}]
set_input_delay -clock clk  0  [get_ports {inp[54]}]
set_input_delay -clock clk  0  [get_ports {inp[53]}]
set_input_delay -clock clk  0  [get_ports {inp[52]}]
set_input_delay -clock clk  0  [get_ports {inp[51]}]
set_input_delay -clock clk  0  [get_ports {inp[50]}]
set_input_delay -clock clk  0  [get_ports {inp[49]}]
set_input_delay -clock clk  0  [get_ports {inp[48]}]
set_input_delay -clock clk  0  [get_ports {inp[47]}]
set_input_delay -clock clk  0  [get_ports {inp[46]}]
set_input_delay -clock clk  0  [get_ports {inp[45]}]
set_input_delay -clock clk  0  [get_ports {inp[44]}]
set_input_delay -clock clk  0  [get_ports {inp[43]}]
set_input_delay -clock clk  0  [get_ports {inp[42]}]
set_input_delay -clock clk  0  [get_ports {inp[41]}]
set_input_delay -clock clk  0  [get_ports {inp[40]}]
set_input_delay -clock clk  0  [get_ports {inp[39]}]
set_input_delay -clock clk  0  [get_ports {inp[38]}]
set_input_delay -clock clk  0  [get_ports {inp[37]}]
set_input_delay -clock clk  0  [get_ports {inp[36]}]
set_input_delay -clock clk  0  [get_ports {inp[35]}]
set_input_delay -clock clk  0  [get_ports {inp[34]}]
set_input_delay -clock clk  0  [get_ports {inp[33]}]
set_input_delay -clock clk  0  [get_ports {inp[32]}]
set_input_delay -clock clk  0  [get_ports {inp[31]}]
set_input_delay -clock clk  0  [get_ports {inp[30]}]
set_input_delay -clock clk  0  [get_ports {inp[29]}]
set_input_delay -clock clk  0  [get_ports {inp[28]}]
set_input_delay -clock clk  0  [get_ports {inp[27]}]
set_input_delay -clock clk  0  [get_ports {inp[26]}]
set_input_delay -clock clk  0  [get_ports {inp[25]}]
set_input_delay -clock clk  0  [get_ports {inp[24]}]
set_input_delay -clock clk  0  [get_ports {inp[23]}]
set_input_delay -clock clk  0  [get_ports {inp[22]}]
set_input_delay -clock clk  0  [get_ports {inp[21]}]
set_input_delay -clock clk  0  [get_ports {inp[20]}]
set_input_delay -clock clk  0  [get_ports {inp[19]}]
set_input_delay -clock clk  0  [get_ports {inp[18]}]
set_input_delay -clock clk  0  [get_ports {inp[17]}]
set_input_delay -clock clk  0  [get_ports {inp[16]}]
set_input_delay -clock clk  0  [get_ports {inp[15]}]
set_input_delay -clock clk  0  [get_ports {inp[14]}]
set_input_delay -clock clk  0  [get_ports {inp[13]}]
set_input_delay -clock clk  0  [get_ports {inp[12]}]
set_input_delay -clock clk  0  [get_ports {inp[11]}]
set_input_delay -clock clk  0  [get_ports {inp[10]}]
set_input_delay -clock clk  0  [get_ports {inp[9]}]
set_input_delay -clock clk  0  [get_ports {inp[8]}]
set_input_delay -clock clk  0  [get_ports {inp[7]}]
set_input_delay -clock clk  0  [get_ports {inp[6]}]
set_input_delay -clock clk  0  [get_ports {inp[5]}]
set_input_delay -clock clk  0  [get_ports {inp[4]}]
set_input_delay -clock clk  0  [get_ports {inp[3]}]
set_input_delay -clock clk  0  [get_ports {inp[2]}]
set_input_delay -clock clk  0  [get_ports {inp[1]}]
set_input_delay -clock clk  0  [get_ports {inp[0]}]
set_input_delay -clock clk  0  [get_ports {weights[623]}]
set_input_delay -clock clk  0  [get_ports {weights[622]}]
set_input_delay -clock clk  0  [get_ports {weights[621]}]
set_input_delay -clock clk  0  [get_ports {weights[620]}]
set_input_delay -clock clk  0  [get_ports {weights[619]}]
set_input_delay -clock clk  0  [get_ports {weights[618]}]
set_input_delay -clock clk  0  [get_ports {weights[617]}]
set_input_delay -clock clk  0  [get_ports {weights[616]}]
set_input_delay -clock clk  0  [get_ports {weights[615]}]
set_input_delay -clock clk  0  [get_ports {weights[614]}]
set_input_delay -clock clk  0  [get_ports {weights[613]}]
set_input_delay -clock clk  0  [get_ports {weights[612]}]
set_input_delay -clock clk  0  [get_ports {weights[611]}]
set_input_delay -clock clk  0  [get_ports {weights[610]}]
set_input_delay -clock clk  0  [get_ports {weights[609]}]
set_input_delay -clock clk  0  [get_ports {weights[608]}]
set_input_delay -clock clk  0  [get_ports {weights[607]}]
set_input_delay -clock clk  0  [get_ports {weights[606]}]
set_input_delay -clock clk  0  [get_ports {weights[605]}]
set_input_delay -clock clk  0  [get_ports {weights[604]}]
set_input_delay -clock clk  0  [get_ports {weights[603]}]
set_input_delay -clock clk  0  [get_ports {weights[602]}]
set_input_delay -clock clk  0  [get_ports {weights[601]}]
set_input_delay -clock clk  0  [get_ports {weights[600]}]
set_input_delay -clock clk  0  [get_ports {weights[599]}]
set_input_delay -clock clk  0  [get_ports {weights[598]}]
set_input_delay -clock clk  0  [get_ports {weights[597]}]
set_input_delay -clock clk  0  [get_ports {weights[596]}]
set_input_delay -clock clk  0  [get_ports {weights[595]}]
set_input_delay -clock clk  0  [get_ports {weights[594]}]
set_input_delay -clock clk  0  [get_ports {weights[593]}]
set_input_delay -clock clk  0  [get_ports {weights[592]}]
set_input_delay -clock clk  0  [get_ports {weights[591]}]
set_input_delay -clock clk  0  [get_ports {weights[590]}]
set_input_delay -clock clk  0  [get_ports {weights[589]}]
set_input_delay -clock clk  0  [get_ports {weights[588]}]
set_input_delay -clock clk  0  [get_ports {weights[587]}]
set_input_delay -clock clk  0  [get_ports {weights[586]}]
set_input_delay -clock clk  0  [get_ports {weights[585]}]
set_input_delay -clock clk  0  [get_ports {weights[584]}]
set_input_delay -clock clk  0  [get_ports {weights[583]}]
set_input_delay -clock clk  0  [get_ports {weights[582]}]
set_input_delay -clock clk  0  [get_ports {weights[581]}]
set_input_delay -clock clk  0  [get_ports {weights[580]}]
set_input_delay -clock clk  0  [get_ports {weights[579]}]
set_input_delay -clock clk  0  [get_ports {weights[578]}]
set_input_delay -clock clk  0  [get_ports {weights[577]}]
set_input_delay -clock clk  0  [get_ports {weights[576]}]
set_input_delay -clock clk  0  [get_ports {weights[575]}]
set_input_delay -clock clk  0  [get_ports {weights[574]}]
set_input_delay -clock clk  0  [get_ports {weights[573]}]
set_input_delay -clock clk  0  [get_ports {weights[572]}]
set_input_delay -clock clk  0  [get_ports {weights[571]}]
set_input_delay -clock clk  0  [get_ports {weights[570]}]
set_input_delay -clock clk  0  [get_ports {weights[569]}]
set_input_delay -clock clk  0  [get_ports {weights[568]}]
set_input_delay -clock clk  0  [get_ports {weights[567]}]
set_input_delay -clock clk  0  [get_ports {weights[566]}]
set_input_delay -clock clk  0  [get_ports {weights[565]}]
set_input_delay -clock clk  0  [get_ports {weights[564]}]
set_input_delay -clock clk  0  [get_ports {weights[563]}]
set_input_delay -clock clk  0  [get_ports {weights[562]}]
set_input_delay -clock clk  0  [get_ports {weights[561]}]
set_input_delay -clock clk  0  [get_ports {weights[560]}]
set_input_delay -clock clk  0  [get_ports {weights[559]}]
set_input_delay -clock clk  0  [get_ports {weights[558]}]
set_input_delay -clock clk  0  [get_ports {weights[557]}]
set_input_delay -clock clk  0  [get_ports {weights[556]}]
set_input_delay -clock clk  0  [get_ports {weights[555]}]
set_input_delay -clock clk  0  [get_ports {weights[554]}]
set_input_delay -clock clk  0  [get_ports {weights[553]}]
set_input_delay -clock clk  0  [get_ports {weights[552]}]
set_input_delay -clock clk  0  [get_ports {weights[551]}]
set_input_delay -clock clk  0  [get_ports {weights[550]}]
set_input_delay -clock clk  0  [get_ports {weights[549]}]
set_input_delay -clock clk  0  [get_ports {weights[548]}]
set_input_delay -clock clk  0  [get_ports {weights[547]}]
set_input_delay -clock clk  0  [get_ports {weights[546]}]
set_input_delay -clock clk  0  [get_ports {weights[545]}]
set_input_delay -clock clk  0  [get_ports {weights[544]}]
set_input_delay -clock clk  0  [get_ports {weights[543]}]
set_input_delay -clock clk  0  [get_ports {weights[542]}]
set_input_delay -clock clk  0  [get_ports {weights[541]}]
set_input_delay -clock clk  0  [get_ports {weights[540]}]
set_input_delay -clock clk  0  [get_ports {weights[539]}]
set_input_delay -clock clk  0  [get_ports {weights[538]}]
set_input_delay -clock clk  0  [get_ports {weights[537]}]
set_input_delay -clock clk  0  [get_ports {weights[536]}]
set_input_delay -clock clk  0  [get_ports {weights[535]}]
set_input_delay -clock clk  0  [get_ports {weights[534]}]
set_input_delay -clock clk  0  [get_ports {weights[533]}]
set_input_delay -clock clk  0  [get_ports {weights[532]}]
set_input_delay -clock clk  0  [get_ports {weights[531]}]
set_input_delay -clock clk  0  [get_ports {weights[530]}]
set_input_delay -clock clk  0  [get_ports {weights[529]}]
set_input_delay -clock clk  0  [get_ports {weights[528]}]
set_input_delay -clock clk  0  [get_ports {weights[527]}]
set_input_delay -clock clk  0  [get_ports {weights[526]}]
set_input_delay -clock clk  0  [get_ports {weights[525]}]
set_input_delay -clock clk  0  [get_ports {weights[524]}]
set_input_delay -clock clk  0  [get_ports {weights[523]}]
set_input_delay -clock clk  0  [get_ports {weights[522]}]
set_input_delay -clock clk  0  [get_ports {weights[521]}]
set_input_delay -clock clk  0  [get_ports {weights[520]}]
set_input_delay -clock clk  0  [get_ports {weights[519]}]
set_input_delay -clock clk  0  [get_ports {weights[518]}]
set_input_delay -clock clk  0  [get_ports {weights[517]}]
set_input_delay -clock clk  0  [get_ports {weights[516]}]
set_input_delay -clock clk  0  [get_ports {weights[515]}]
set_input_delay -clock clk  0  [get_ports {weights[514]}]
set_input_delay -clock clk  0  [get_ports {weights[513]}]
set_input_delay -clock clk  0  [get_ports {weights[512]}]
set_input_delay -clock clk  0  [get_ports {weights[511]}]
set_input_delay -clock clk  0  [get_ports {weights[510]}]
set_input_delay -clock clk  0  [get_ports {weights[509]}]
set_input_delay -clock clk  0  [get_ports {weights[508]}]
set_input_delay -clock clk  0  [get_ports {weights[507]}]
set_input_delay -clock clk  0  [get_ports {weights[506]}]
set_input_delay -clock clk  0  [get_ports {weights[505]}]
set_input_delay -clock clk  0  [get_ports {weights[504]}]
set_input_delay -clock clk  0  [get_ports {weights[503]}]
set_input_delay -clock clk  0  [get_ports {weights[502]}]
set_input_delay -clock clk  0  [get_ports {weights[501]}]
set_input_delay -clock clk  0  [get_ports {weights[500]}]
set_input_delay -clock clk  0  [get_ports {weights[499]}]
set_input_delay -clock clk  0  [get_ports {weights[498]}]
set_input_delay -clock clk  0  [get_ports {weights[497]}]
set_input_delay -clock clk  0  [get_ports {weights[496]}]
set_input_delay -clock clk  0  [get_ports {weights[495]}]
set_input_delay -clock clk  0  [get_ports {weights[494]}]
set_input_delay -clock clk  0  [get_ports {weights[493]}]
set_input_delay -clock clk  0  [get_ports {weights[492]}]
set_input_delay -clock clk  0  [get_ports {weights[491]}]
set_input_delay -clock clk  0  [get_ports {weights[490]}]
set_input_delay -clock clk  0  [get_ports {weights[489]}]
set_input_delay -clock clk  0  [get_ports {weights[488]}]
set_input_delay -clock clk  0  [get_ports {weights[487]}]
set_input_delay -clock clk  0  [get_ports {weights[486]}]
set_input_delay -clock clk  0  [get_ports {weights[485]}]
set_input_delay -clock clk  0  [get_ports {weights[484]}]
set_input_delay -clock clk  0  [get_ports {weights[483]}]
set_input_delay -clock clk  0  [get_ports {weights[482]}]
set_input_delay -clock clk  0  [get_ports {weights[481]}]
set_input_delay -clock clk  0  [get_ports {weights[480]}]
set_input_delay -clock clk  0  [get_ports {weights[479]}]
set_input_delay -clock clk  0  [get_ports {weights[478]}]
set_input_delay -clock clk  0  [get_ports {weights[477]}]
set_input_delay -clock clk  0  [get_ports {weights[476]}]
set_input_delay -clock clk  0  [get_ports {weights[475]}]
set_input_delay -clock clk  0  [get_ports {weights[474]}]
set_input_delay -clock clk  0  [get_ports {weights[473]}]
set_input_delay -clock clk  0  [get_ports {weights[472]}]
set_input_delay -clock clk  0  [get_ports {weights[471]}]
set_input_delay -clock clk  0  [get_ports {weights[470]}]
set_input_delay -clock clk  0  [get_ports {weights[469]}]
set_input_delay -clock clk  0  [get_ports {weights[468]}]
set_input_delay -clock clk  0  [get_ports {weights[467]}]
set_input_delay -clock clk  0  [get_ports {weights[466]}]
set_input_delay -clock clk  0  [get_ports {weights[465]}]
set_input_delay -clock clk  0  [get_ports {weights[464]}]
set_input_delay -clock clk  0  [get_ports {weights[463]}]
set_input_delay -clock clk  0  [get_ports {weights[462]}]
set_input_delay -clock clk  0  [get_ports {weights[461]}]
set_input_delay -clock clk  0  [get_ports {weights[460]}]
set_input_delay -clock clk  0  [get_ports {weights[459]}]
set_input_delay -clock clk  0  [get_ports {weights[458]}]
set_input_delay -clock clk  0  [get_ports {weights[457]}]
set_input_delay -clock clk  0  [get_ports {weights[456]}]
set_input_delay -clock clk  0  [get_ports {weights[455]}]
set_input_delay -clock clk  0  [get_ports {weights[454]}]
set_input_delay -clock clk  0  [get_ports {weights[453]}]
set_input_delay -clock clk  0  [get_ports {weights[452]}]
set_input_delay -clock clk  0  [get_ports {weights[451]}]
set_input_delay -clock clk  0  [get_ports {weights[450]}]
set_input_delay -clock clk  0  [get_ports {weights[449]}]
set_input_delay -clock clk  0  [get_ports {weights[448]}]
set_input_delay -clock clk  0  [get_ports {weights[447]}]
set_input_delay -clock clk  0  [get_ports {weights[446]}]
set_input_delay -clock clk  0  [get_ports {weights[445]}]
set_input_delay -clock clk  0  [get_ports {weights[444]}]
set_input_delay -clock clk  0  [get_ports {weights[443]}]
set_input_delay -clock clk  0  [get_ports {weights[442]}]
set_input_delay -clock clk  0  [get_ports {weights[441]}]
set_input_delay -clock clk  0  [get_ports {weights[440]}]
set_input_delay -clock clk  0  [get_ports {weights[439]}]
set_input_delay -clock clk  0  [get_ports {weights[438]}]
set_input_delay -clock clk  0  [get_ports {weights[437]}]
set_input_delay -clock clk  0  [get_ports {weights[436]}]
set_input_delay -clock clk  0  [get_ports {weights[435]}]
set_input_delay -clock clk  0  [get_ports {weights[434]}]
set_input_delay -clock clk  0  [get_ports {weights[433]}]
set_input_delay -clock clk  0  [get_ports {weights[432]}]
set_input_delay -clock clk  0  [get_ports {weights[431]}]
set_input_delay -clock clk  0  [get_ports {weights[430]}]
set_input_delay -clock clk  0  [get_ports {weights[429]}]
set_input_delay -clock clk  0  [get_ports {weights[428]}]
set_input_delay -clock clk  0  [get_ports {weights[427]}]
set_input_delay -clock clk  0  [get_ports {weights[426]}]
set_input_delay -clock clk  0  [get_ports {weights[425]}]
set_input_delay -clock clk  0  [get_ports {weights[424]}]
set_input_delay -clock clk  0  [get_ports {weights[423]}]
set_input_delay -clock clk  0  [get_ports {weights[422]}]
set_input_delay -clock clk  0  [get_ports {weights[421]}]
set_input_delay -clock clk  0  [get_ports {weights[420]}]
set_input_delay -clock clk  0  [get_ports {weights[419]}]
set_input_delay -clock clk  0  [get_ports {weights[418]}]
set_input_delay -clock clk  0  [get_ports {weights[417]}]
set_input_delay -clock clk  0  [get_ports {weights[416]}]
set_input_delay -clock clk  0  [get_ports {weights[415]}]
set_input_delay -clock clk  0  [get_ports {weights[414]}]
set_input_delay -clock clk  0  [get_ports {weights[413]}]
set_input_delay -clock clk  0  [get_ports {weights[412]}]
set_input_delay -clock clk  0  [get_ports {weights[411]}]
set_input_delay -clock clk  0  [get_ports {weights[410]}]
set_input_delay -clock clk  0  [get_ports {weights[409]}]
set_input_delay -clock clk  0  [get_ports {weights[408]}]
set_input_delay -clock clk  0  [get_ports {weights[407]}]
set_input_delay -clock clk  0  [get_ports {weights[406]}]
set_input_delay -clock clk  0  [get_ports {weights[405]}]
set_input_delay -clock clk  0  [get_ports {weights[404]}]
set_input_delay -clock clk  0  [get_ports {weights[403]}]
set_input_delay -clock clk  0  [get_ports {weights[402]}]
set_input_delay -clock clk  0  [get_ports {weights[401]}]
set_input_delay -clock clk  0  [get_ports {weights[400]}]
set_input_delay -clock clk  0  [get_ports {weights[399]}]
set_input_delay -clock clk  0  [get_ports {weights[398]}]
set_input_delay -clock clk  0  [get_ports {weights[397]}]
set_input_delay -clock clk  0  [get_ports {weights[396]}]
set_input_delay -clock clk  0  [get_ports {weights[395]}]
set_input_delay -clock clk  0  [get_ports {weights[394]}]
set_input_delay -clock clk  0  [get_ports {weights[393]}]
set_input_delay -clock clk  0  [get_ports {weights[392]}]
set_input_delay -clock clk  0  [get_ports {weights[391]}]
set_input_delay -clock clk  0  [get_ports {weights[390]}]
set_input_delay -clock clk  0  [get_ports {weights[389]}]
set_input_delay -clock clk  0  [get_ports {weights[388]}]
set_input_delay -clock clk  0  [get_ports {weights[387]}]
set_input_delay -clock clk  0  [get_ports {weights[386]}]
set_input_delay -clock clk  0  [get_ports {weights[385]}]
set_input_delay -clock clk  0  [get_ports {weights[384]}]
set_input_delay -clock clk  0  [get_ports {weights[383]}]
set_input_delay -clock clk  0  [get_ports {weights[382]}]
set_input_delay -clock clk  0  [get_ports {weights[381]}]
set_input_delay -clock clk  0  [get_ports {weights[380]}]
set_input_delay -clock clk  0  [get_ports {weights[379]}]
set_input_delay -clock clk  0  [get_ports {weights[378]}]
set_input_delay -clock clk  0  [get_ports {weights[377]}]
set_input_delay -clock clk  0  [get_ports {weights[376]}]
set_input_delay -clock clk  0  [get_ports {weights[375]}]
set_input_delay -clock clk  0  [get_ports {weights[374]}]
set_input_delay -clock clk  0  [get_ports {weights[373]}]
set_input_delay -clock clk  0  [get_ports {weights[372]}]
set_input_delay -clock clk  0  [get_ports {weights[371]}]
set_input_delay -clock clk  0  [get_ports {weights[370]}]
set_input_delay -clock clk  0  [get_ports {weights[369]}]
set_input_delay -clock clk  0  [get_ports {weights[368]}]
set_input_delay -clock clk  0  [get_ports {weights[367]}]
set_input_delay -clock clk  0  [get_ports {weights[366]}]
set_input_delay -clock clk  0  [get_ports {weights[365]}]
set_input_delay -clock clk  0  [get_ports {weights[364]}]
set_input_delay -clock clk  0  [get_ports {weights[363]}]
set_input_delay -clock clk  0  [get_ports {weights[362]}]
set_input_delay -clock clk  0  [get_ports {weights[361]}]
set_input_delay -clock clk  0  [get_ports {weights[360]}]
set_input_delay -clock clk  0  [get_ports {weights[359]}]
set_input_delay -clock clk  0  [get_ports {weights[358]}]
set_input_delay -clock clk  0  [get_ports {weights[357]}]
set_input_delay -clock clk  0  [get_ports {weights[356]}]
set_input_delay -clock clk  0  [get_ports {weights[355]}]
set_input_delay -clock clk  0  [get_ports {weights[354]}]
set_input_delay -clock clk  0  [get_ports {weights[353]}]
set_input_delay -clock clk  0  [get_ports {weights[352]}]
set_input_delay -clock clk  0  [get_ports {weights[351]}]
set_input_delay -clock clk  0  [get_ports {weights[350]}]
set_input_delay -clock clk  0  [get_ports {weights[349]}]
set_input_delay -clock clk  0  [get_ports {weights[348]}]
set_input_delay -clock clk  0  [get_ports {weights[347]}]
set_input_delay -clock clk  0  [get_ports {weights[346]}]
set_input_delay -clock clk  0  [get_ports {weights[345]}]
set_input_delay -clock clk  0  [get_ports {weights[344]}]
set_input_delay -clock clk  0  [get_ports {weights[343]}]
set_input_delay -clock clk  0  [get_ports {weights[342]}]
set_input_delay -clock clk  0  [get_ports {weights[341]}]
set_input_delay -clock clk  0  [get_ports {weights[340]}]
set_input_delay -clock clk  0  [get_ports {weights[339]}]
set_input_delay -clock clk  0  [get_ports {weights[338]}]
set_input_delay -clock clk  0  [get_ports {weights[337]}]
set_input_delay -clock clk  0  [get_ports {weights[336]}]
set_input_delay -clock clk  0  [get_ports {weights[335]}]
set_input_delay -clock clk  0  [get_ports {weights[334]}]
set_input_delay -clock clk  0  [get_ports {weights[333]}]
set_input_delay -clock clk  0  [get_ports {weights[332]}]
set_input_delay -clock clk  0  [get_ports {weights[331]}]
set_input_delay -clock clk  0  [get_ports {weights[330]}]
set_input_delay -clock clk  0  [get_ports {weights[329]}]
set_input_delay -clock clk  0  [get_ports {weights[328]}]
set_input_delay -clock clk  0  [get_ports {weights[327]}]
set_input_delay -clock clk  0  [get_ports {weights[326]}]
set_input_delay -clock clk  0  [get_ports {weights[325]}]
set_input_delay -clock clk  0  [get_ports {weights[324]}]
set_input_delay -clock clk  0  [get_ports {weights[323]}]
set_input_delay -clock clk  0  [get_ports {weights[322]}]
set_input_delay -clock clk  0  [get_ports {weights[321]}]
set_input_delay -clock clk  0  [get_ports {weights[320]}]
set_input_delay -clock clk  0  [get_ports {weights[319]}]
set_input_delay -clock clk  0  [get_ports {weights[318]}]
set_input_delay -clock clk  0  [get_ports {weights[317]}]
set_input_delay -clock clk  0  [get_ports {weights[316]}]
set_input_delay -clock clk  0  [get_ports {weights[315]}]
set_input_delay -clock clk  0  [get_ports {weights[314]}]
set_input_delay -clock clk  0  [get_ports {weights[313]}]
set_input_delay -clock clk  0  [get_ports {weights[312]}]
set_input_delay -clock clk  0  [get_ports {weights[311]}]
set_input_delay -clock clk  0  [get_ports {weights[310]}]
set_input_delay -clock clk  0  [get_ports {weights[309]}]
set_input_delay -clock clk  0  [get_ports {weights[308]}]
set_input_delay -clock clk  0  [get_ports {weights[307]}]
set_input_delay -clock clk  0  [get_ports {weights[306]}]
set_input_delay -clock clk  0  [get_ports {weights[305]}]
set_input_delay -clock clk  0  [get_ports {weights[304]}]
set_input_delay -clock clk  0  [get_ports {weights[303]}]
set_input_delay -clock clk  0  [get_ports {weights[302]}]
set_input_delay -clock clk  0  [get_ports {weights[301]}]
set_input_delay -clock clk  0  [get_ports {weights[300]}]
set_input_delay -clock clk  0  [get_ports {weights[299]}]
set_input_delay -clock clk  0  [get_ports {weights[298]}]
set_input_delay -clock clk  0  [get_ports {weights[297]}]
set_input_delay -clock clk  0  [get_ports {weights[296]}]
set_input_delay -clock clk  0  [get_ports {weights[295]}]
set_input_delay -clock clk  0  [get_ports {weights[294]}]
set_input_delay -clock clk  0  [get_ports {weights[293]}]
set_input_delay -clock clk  0  [get_ports {weights[292]}]
set_input_delay -clock clk  0  [get_ports {weights[291]}]
set_input_delay -clock clk  0  [get_ports {weights[290]}]
set_input_delay -clock clk  0  [get_ports {weights[289]}]
set_input_delay -clock clk  0  [get_ports {weights[288]}]
set_input_delay -clock clk  0  [get_ports {weights[287]}]
set_input_delay -clock clk  0  [get_ports {weights[286]}]
set_input_delay -clock clk  0  [get_ports {weights[285]}]
set_input_delay -clock clk  0  [get_ports {weights[284]}]
set_input_delay -clock clk  0  [get_ports {weights[283]}]
set_input_delay -clock clk  0  [get_ports {weights[282]}]
set_input_delay -clock clk  0  [get_ports {weights[281]}]
set_input_delay -clock clk  0  [get_ports {weights[280]}]
set_input_delay -clock clk  0  [get_ports {weights[279]}]
set_input_delay -clock clk  0  [get_ports {weights[278]}]
set_input_delay -clock clk  0  [get_ports {weights[277]}]
set_input_delay -clock clk  0  [get_ports {weights[276]}]
set_input_delay -clock clk  0  [get_ports {weights[275]}]
set_input_delay -clock clk  0  [get_ports {weights[274]}]
set_input_delay -clock clk  0  [get_ports {weights[273]}]
set_input_delay -clock clk  0  [get_ports {weights[272]}]
set_input_delay -clock clk  0  [get_ports {weights[271]}]
set_input_delay -clock clk  0  [get_ports {weights[270]}]
set_input_delay -clock clk  0  [get_ports {weights[269]}]
set_input_delay -clock clk  0  [get_ports {weights[268]}]
set_input_delay -clock clk  0  [get_ports {weights[267]}]
set_input_delay -clock clk  0  [get_ports {weights[266]}]
set_input_delay -clock clk  0  [get_ports {weights[265]}]
set_input_delay -clock clk  0  [get_ports {weights[264]}]
set_input_delay -clock clk  0  [get_ports {weights[263]}]
set_input_delay -clock clk  0  [get_ports {weights[262]}]
set_input_delay -clock clk  0  [get_ports {weights[261]}]
set_input_delay -clock clk  0  [get_ports {weights[260]}]
set_input_delay -clock clk  0  [get_ports {weights[259]}]
set_input_delay -clock clk  0  [get_ports {weights[258]}]
set_input_delay -clock clk  0  [get_ports {weights[257]}]
set_input_delay -clock clk  0  [get_ports {weights[256]}]
set_input_delay -clock clk  0  [get_ports {weights[255]}]
set_input_delay -clock clk  0  [get_ports {weights[254]}]
set_input_delay -clock clk  0  [get_ports {weights[253]}]
set_input_delay -clock clk  0  [get_ports {weights[252]}]
set_input_delay -clock clk  0  [get_ports {weights[251]}]
set_input_delay -clock clk  0  [get_ports {weights[250]}]
set_input_delay -clock clk  0  [get_ports {weights[249]}]
set_input_delay -clock clk  0  [get_ports {weights[248]}]
set_input_delay -clock clk  0  [get_ports {weights[247]}]
set_input_delay -clock clk  0  [get_ports {weights[246]}]
set_input_delay -clock clk  0  [get_ports {weights[245]}]
set_input_delay -clock clk  0  [get_ports {weights[244]}]
set_input_delay -clock clk  0  [get_ports {weights[243]}]
set_input_delay -clock clk  0  [get_ports {weights[242]}]
set_input_delay -clock clk  0  [get_ports {weights[241]}]
set_input_delay -clock clk  0  [get_ports {weights[240]}]
set_input_delay -clock clk  0  [get_ports {weights[239]}]
set_input_delay -clock clk  0  [get_ports {weights[238]}]
set_input_delay -clock clk  0  [get_ports {weights[237]}]
set_input_delay -clock clk  0  [get_ports {weights[236]}]
set_input_delay -clock clk  0  [get_ports {weights[235]}]
set_input_delay -clock clk  0  [get_ports {weights[234]}]
set_input_delay -clock clk  0  [get_ports {weights[233]}]
set_input_delay -clock clk  0  [get_ports {weights[232]}]
set_input_delay -clock clk  0  [get_ports {weights[231]}]
set_input_delay -clock clk  0  [get_ports {weights[230]}]
set_input_delay -clock clk  0  [get_ports {weights[229]}]
set_input_delay -clock clk  0  [get_ports {weights[228]}]
set_input_delay -clock clk  0  [get_ports {weights[227]}]
set_input_delay -clock clk  0  [get_ports {weights[226]}]
set_input_delay -clock clk  0  [get_ports {weights[225]}]
set_input_delay -clock clk  0  [get_ports {weights[224]}]
set_input_delay -clock clk  0  [get_ports {weights[223]}]
set_input_delay -clock clk  0  [get_ports {weights[222]}]
set_input_delay -clock clk  0  [get_ports {weights[221]}]
set_input_delay -clock clk  0  [get_ports {weights[220]}]
set_input_delay -clock clk  0  [get_ports {weights[219]}]
set_input_delay -clock clk  0  [get_ports {weights[218]}]
set_input_delay -clock clk  0  [get_ports {weights[217]}]
set_input_delay -clock clk  0  [get_ports {weights[216]}]
set_input_delay -clock clk  0  [get_ports {weights[215]}]
set_input_delay -clock clk  0  [get_ports {weights[214]}]
set_input_delay -clock clk  0  [get_ports {weights[213]}]
set_input_delay -clock clk  0  [get_ports {weights[212]}]
set_input_delay -clock clk  0  [get_ports {weights[211]}]
set_input_delay -clock clk  0  [get_ports {weights[210]}]
set_input_delay -clock clk  0  [get_ports {weights[209]}]
set_input_delay -clock clk  0  [get_ports {weights[208]}]
set_input_delay -clock clk  0  [get_ports {weights[207]}]
set_input_delay -clock clk  0  [get_ports {weights[206]}]
set_input_delay -clock clk  0  [get_ports {weights[205]}]
set_input_delay -clock clk  0  [get_ports {weights[204]}]
set_input_delay -clock clk  0  [get_ports {weights[203]}]
set_input_delay -clock clk  0  [get_ports {weights[202]}]
set_input_delay -clock clk  0  [get_ports {weights[201]}]
set_input_delay -clock clk  0  [get_ports {weights[200]}]
set_input_delay -clock clk  0  [get_ports {weights[199]}]
set_input_delay -clock clk  0  [get_ports {weights[198]}]
set_input_delay -clock clk  0  [get_ports {weights[197]}]
set_input_delay -clock clk  0  [get_ports {weights[196]}]
set_input_delay -clock clk  0  [get_ports {weights[195]}]
set_input_delay -clock clk  0  [get_ports {weights[194]}]
set_input_delay -clock clk  0  [get_ports {weights[193]}]
set_input_delay -clock clk  0  [get_ports {weights[192]}]
set_input_delay -clock clk  0  [get_ports {weights[191]}]
set_input_delay -clock clk  0  [get_ports {weights[190]}]
set_input_delay -clock clk  0  [get_ports {weights[189]}]
set_input_delay -clock clk  0  [get_ports {weights[188]}]
set_input_delay -clock clk  0  [get_ports {weights[187]}]
set_input_delay -clock clk  0  [get_ports {weights[186]}]
set_input_delay -clock clk  0  [get_ports {weights[185]}]
set_input_delay -clock clk  0  [get_ports {weights[184]}]
set_input_delay -clock clk  0  [get_ports {weights[183]}]
set_input_delay -clock clk  0  [get_ports {weights[182]}]
set_input_delay -clock clk  0  [get_ports {weights[181]}]
set_input_delay -clock clk  0  [get_ports {weights[180]}]
set_input_delay -clock clk  0  [get_ports {weights[179]}]
set_input_delay -clock clk  0  [get_ports {weights[178]}]
set_input_delay -clock clk  0  [get_ports {weights[177]}]
set_input_delay -clock clk  0  [get_ports {weights[176]}]
set_input_delay -clock clk  0  [get_ports {weights[175]}]
set_input_delay -clock clk  0  [get_ports {weights[174]}]
set_input_delay -clock clk  0  [get_ports {weights[173]}]
set_input_delay -clock clk  0  [get_ports {weights[172]}]
set_input_delay -clock clk  0  [get_ports {weights[171]}]
set_input_delay -clock clk  0  [get_ports {weights[170]}]
set_input_delay -clock clk  0  [get_ports {weights[169]}]
set_input_delay -clock clk  0  [get_ports {weights[168]}]
set_input_delay -clock clk  0  [get_ports {weights[167]}]
set_input_delay -clock clk  0  [get_ports {weights[166]}]
set_input_delay -clock clk  0  [get_ports {weights[165]}]
set_input_delay -clock clk  0  [get_ports {weights[164]}]
set_input_delay -clock clk  0  [get_ports {weights[163]}]
set_input_delay -clock clk  0  [get_ports {weights[162]}]
set_input_delay -clock clk  0  [get_ports {weights[161]}]
set_input_delay -clock clk  0  [get_ports {weights[160]}]
set_input_delay -clock clk  0  [get_ports {weights[159]}]
set_input_delay -clock clk  0  [get_ports {weights[158]}]
set_input_delay -clock clk  0  [get_ports {weights[157]}]
set_input_delay -clock clk  0  [get_ports {weights[156]}]
set_input_delay -clock clk  0  [get_ports {weights[155]}]
set_input_delay -clock clk  0  [get_ports {weights[154]}]
set_input_delay -clock clk  0  [get_ports {weights[153]}]
set_input_delay -clock clk  0  [get_ports {weights[152]}]
set_input_delay -clock clk  0  [get_ports {weights[151]}]
set_input_delay -clock clk  0  [get_ports {weights[150]}]
set_input_delay -clock clk  0  [get_ports {weights[149]}]
set_input_delay -clock clk  0  [get_ports {weights[148]}]
set_input_delay -clock clk  0  [get_ports {weights[147]}]
set_input_delay -clock clk  0  [get_ports {weights[146]}]
set_input_delay -clock clk  0  [get_ports {weights[145]}]
set_input_delay -clock clk  0  [get_ports {weights[144]}]
set_input_delay -clock clk  0  [get_ports {weights[143]}]
set_input_delay -clock clk  0  [get_ports {weights[142]}]
set_input_delay -clock clk  0  [get_ports {weights[141]}]
set_input_delay -clock clk  0  [get_ports {weights[140]}]
set_input_delay -clock clk  0  [get_ports {weights[139]}]
set_input_delay -clock clk  0  [get_ports {weights[138]}]
set_input_delay -clock clk  0  [get_ports {weights[137]}]
set_input_delay -clock clk  0  [get_ports {weights[136]}]
set_input_delay -clock clk  0  [get_ports {weights[135]}]
set_input_delay -clock clk  0  [get_ports {weights[134]}]
set_input_delay -clock clk  0  [get_ports {weights[133]}]
set_input_delay -clock clk  0  [get_ports {weights[132]}]
set_input_delay -clock clk  0  [get_ports {weights[131]}]
set_input_delay -clock clk  0  [get_ports {weights[130]}]
set_input_delay -clock clk  0  [get_ports {weights[129]}]
set_input_delay -clock clk  0  [get_ports {weights[128]}]
set_input_delay -clock clk  0  [get_ports {weights[127]}]
set_input_delay -clock clk  0  [get_ports {weights[126]}]
set_input_delay -clock clk  0  [get_ports {weights[125]}]
set_input_delay -clock clk  0  [get_ports {weights[124]}]
set_input_delay -clock clk  0  [get_ports {weights[123]}]
set_input_delay -clock clk  0  [get_ports {weights[122]}]
set_input_delay -clock clk  0  [get_ports {weights[121]}]
set_input_delay -clock clk  0  [get_ports {weights[120]}]
set_input_delay -clock clk  0  [get_ports {weights[119]}]
set_input_delay -clock clk  0  [get_ports {weights[118]}]
set_input_delay -clock clk  0  [get_ports {weights[117]}]
set_input_delay -clock clk  0  [get_ports {weights[116]}]
set_input_delay -clock clk  0  [get_ports {weights[115]}]
set_input_delay -clock clk  0  [get_ports {weights[114]}]
set_input_delay -clock clk  0  [get_ports {weights[113]}]
set_input_delay -clock clk  0  [get_ports {weights[112]}]
set_input_delay -clock clk  0  [get_ports {weights[111]}]
set_input_delay -clock clk  0  [get_ports {weights[110]}]
set_input_delay -clock clk  0  [get_ports {weights[109]}]
set_input_delay -clock clk  0  [get_ports {weights[108]}]
set_input_delay -clock clk  0  [get_ports {weights[107]}]
set_input_delay -clock clk  0  [get_ports {weights[106]}]
set_input_delay -clock clk  0  [get_ports {weights[105]}]
set_input_delay -clock clk  0  [get_ports {weights[104]}]
set_input_delay -clock clk  0  [get_ports {weights[103]}]
set_input_delay -clock clk  0  [get_ports {weights[102]}]
set_input_delay -clock clk  0  [get_ports {weights[101]}]
set_input_delay -clock clk  0  [get_ports {weights[100]}]
set_input_delay -clock clk  0  [get_ports {weights[99]}]
set_input_delay -clock clk  0  [get_ports {weights[98]}]
set_input_delay -clock clk  0  [get_ports {weights[97]}]
set_input_delay -clock clk  0  [get_ports {weights[96]}]
set_input_delay -clock clk  0  [get_ports {weights[95]}]
set_input_delay -clock clk  0  [get_ports {weights[94]}]
set_input_delay -clock clk  0  [get_ports {weights[93]}]
set_input_delay -clock clk  0  [get_ports {weights[92]}]
set_input_delay -clock clk  0  [get_ports {weights[91]}]
set_input_delay -clock clk  0  [get_ports {weights[90]}]
set_input_delay -clock clk  0  [get_ports {weights[89]}]
set_input_delay -clock clk  0  [get_ports {weights[88]}]
set_input_delay -clock clk  0  [get_ports {weights[87]}]
set_input_delay -clock clk  0  [get_ports {weights[86]}]
set_input_delay -clock clk  0  [get_ports {weights[85]}]
set_input_delay -clock clk  0  [get_ports {weights[84]}]
set_input_delay -clock clk  0  [get_ports {weights[83]}]
set_input_delay -clock clk  0  [get_ports {weights[82]}]
set_input_delay -clock clk  0  [get_ports {weights[81]}]
set_input_delay -clock clk  0  [get_ports {weights[80]}]
set_input_delay -clock clk  0  [get_ports {weights[79]}]
set_input_delay -clock clk  0  [get_ports {weights[78]}]
set_input_delay -clock clk  0  [get_ports {weights[77]}]
set_input_delay -clock clk  0  [get_ports {weights[76]}]
set_input_delay -clock clk  0  [get_ports {weights[75]}]
set_input_delay -clock clk  0  [get_ports {weights[74]}]
set_input_delay -clock clk  0  [get_ports {weights[73]}]
set_input_delay -clock clk  0  [get_ports {weights[72]}]
set_input_delay -clock clk  0  [get_ports {weights[71]}]
set_input_delay -clock clk  0  [get_ports {weights[70]}]
set_input_delay -clock clk  0  [get_ports {weights[69]}]
set_input_delay -clock clk  0  [get_ports {weights[68]}]
set_input_delay -clock clk  0  [get_ports {weights[67]}]
set_input_delay -clock clk  0  [get_ports {weights[66]}]
set_input_delay -clock clk  0  [get_ports {weights[65]}]
set_input_delay -clock clk  0  [get_ports {weights[64]}]
set_input_delay -clock clk  0  [get_ports {weights[63]}]
set_input_delay -clock clk  0  [get_ports {weights[62]}]
set_input_delay -clock clk  0  [get_ports {weights[61]}]
set_input_delay -clock clk  0  [get_ports {weights[60]}]
set_input_delay -clock clk  0  [get_ports {weights[59]}]
set_input_delay -clock clk  0  [get_ports {weights[58]}]
set_input_delay -clock clk  0  [get_ports {weights[57]}]
set_input_delay -clock clk  0  [get_ports {weights[56]}]
set_input_delay -clock clk  0  [get_ports {weights[55]}]
set_input_delay -clock clk  0  [get_ports {weights[54]}]
set_input_delay -clock clk  0  [get_ports {weights[53]}]
set_input_delay -clock clk  0  [get_ports {weights[52]}]
set_input_delay -clock clk  0  [get_ports {weights[51]}]
set_input_delay -clock clk  0  [get_ports {weights[50]}]
set_input_delay -clock clk  0  [get_ports {weights[49]}]
set_input_delay -clock clk  0  [get_ports {weights[48]}]
set_input_delay -clock clk  0  [get_ports {weights[47]}]
set_input_delay -clock clk  0  [get_ports {weights[46]}]
set_input_delay -clock clk  0  [get_ports {weights[45]}]
set_input_delay -clock clk  0  [get_ports {weights[44]}]
set_input_delay -clock clk  0  [get_ports {weights[43]}]
set_input_delay -clock clk  0  [get_ports {weights[42]}]
set_input_delay -clock clk  0  [get_ports {weights[41]}]
set_input_delay -clock clk  0  [get_ports {weights[40]}]
set_input_delay -clock clk  0  [get_ports {weights[39]}]
set_input_delay -clock clk  0  [get_ports {weights[38]}]
set_input_delay -clock clk  0  [get_ports {weights[37]}]
set_input_delay -clock clk  0  [get_ports {weights[36]}]
set_input_delay -clock clk  0  [get_ports {weights[35]}]
set_input_delay -clock clk  0  [get_ports {weights[34]}]
set_input_delay -clock clk  0  [get_ports {weights[33]}]
set_input_delay -clock clk  0  [get_ports {weights[32]}]
set_input_delay -clock clk  0  [get_ports {weights[31]}]
set_input_delay -clock clk  0  [get_ports {weights[30]}]
set_input_delay -clock clk  0  [get_ports {weights[29]}]
set_input_delay -clock clk  0  [get_ports {weights[28]}]
set_input_delay -clock clk  0  [get_ports {weights[27]}]
set_input_delay -clock clk  0  [get_ports {weights[26]}]
set_input_delay -clock clk  0  [get_ports {weights[25]}]
set_input_delay -clock clk  0  [get_ports {weights[24]}]
set_input_delay -clock clk  0  [get_ports {weights[23]}]
set_input_delay -clock clk  0  [get_ports {weights[22]}]
set_input_delay -clock clk  0  [get_ports {weights[21]}]
set_input_delay -clock clk  0  [get_ports {weights[20]}]
set_input_delay -clock clk  0  [get_ports {weights[19]}]
set_input_delay -clock clk  0  [get_ports {weights[18]}]
set_input_delay -clock clk  0  [get_ports {weights[17]}]
set_input_delay -clock clk  0  [get_ports {weights[16]}]
set_input_delay -clock clk  0  [get_ports {weights[15]}]
set_input_delay -clock clk  0  [get_ports {weights[14]}]
set_input_delay -clock clk  0  [get_ports {weights[13]}]
set_input_delay -clock clk  0  [get_ports {weights[12]}]
set_input_delay -clock clk  0  [get_ports {weights[11]}]
set_input_delay -clock clk  0  [get_ports {weights[10]}]
set_input_delay -clock clk  0  [get_ports {weights[9]}]
set_input_delay -clock clk  0  [get_ports {weights[8]}]
set_input_delay -clock clk  0  [get_ports {weights[7]}]
set_input_delay -clock clk  0  [get_ports {weights[6]}]
set_input_delay -clock clk  0  [get_ports {weights[5]}]
set_input_delay -clock clk  0  [get_ports {weights[4]}]
set_input_delay -clock clk  0  [get_ports {weights[3]}]
set_input_delay -clock clk  0  [get_ports {weights[2]}]
set_input_delay -clock clk  0  [get_ports {weights[1]}]
set_input_delay -clock clk  0  [get_ports {weights[0]}]
set_input_delay -clock clk  0  [get_ports {biases[176]}]
set_input_delay -clock clk  0  [get_ports {biases[175]}]
set_input_delay -clock clk  0  [get_ports {biases[174]}]
set_input_delay -clock clk  0  [get_ports {biases[173]}]
set_input_delay -clock clk  0  [get_ports {biases[172]}]
set_input_delay -clock clk  0  [get_ports {biases[171]}]
set_input_delay -clock clk  0  [get_ports {biases[170]}]
set_input_delay -clock clk  0  [get_ports {biases[169]}]
set_input_delay -clock clk  0  [get_ports {biases[168]}]
set_input_delay -clock clk  0  [get_ports {biases[167]}]
set_input_delay -clock clk  0  [get_ports {biases[166]}]
set_input_delay -clock clk  0  [get_ports {biases[165]}]
set_input_delay -clock clk  0  [get_ports {biases[164]}]
set_input_delay -clock clk  0  [get_ports {biases[163]}]
set_input_delay -clock clk  0  [get_ports {biases[162]}]
set_input_delay -clock clk  0  [get_ports {biases[161]}]
set_input_delay -clock clk  0  [get_ports {biases[160]}]
set_input_delay -clock clk  0  [get_ports {biases[159]}]
set_input_delay -clock clk  0  [get_ports {biases[158]}]
set_input_delay -clock clk  0  [get_ports {biases[157]}]
set_input_delay -clock clk  0  [get_ports {biases[156]}]
set_input_delay -clock clk  0  [get_ports {biases[155]}]
set_input_delay -clock clk  0  [get_ports {biases[154]}]
set_input_delay -clock clk  0  [get_ports {biases[153]}]
set_input_delay -clock clk  0  [get_ports {biases[152]}]
set_input_delay -clock clk  0  [get_ports {biases[151]}]
set_input_delay -clock clk  0  [get_ports {biases[150]}]
set_input_delay -clock clk  0  [get_ports {biases[149]}]
set_input_delay -clock clk  0  [get_ports {biases[148]}]
set_input_delay -clock clk  0  [get_ports {biases[147]}]
set_input_delay -clock clk  0  [get_ports {biases[146]}]
set_input_delay -clock clk  0  [get_ports {biases[145]}]
set_input_delay -clock clk  0  [get_ports {biases[144]}]
set_input_delay -clock clk  0  [get_ports {biases[143]}]
set_input_delay -clock clk  0  [get_ports {biases[142]}]
set_input_delay -clock clk  0  [get_ports {biases[141]}]
set_input_delay -clock clk  0  [get_ports {biases[140]}]
set_input_delay -clock clk  0  [get_ports {biases[139]}]
set_input_delay -clock clk  0  [get_ports {biases[138]}]
set_input_delay -clock clk  0  [get_ports {biases[137]}]
set_input_delay -clock clk  0  [get_ports {biases[136]}]
set_input_delay -clock clk  0  [get_ports {biases[135]}]
set_input_delay -clock clk  0  [get_ports {biases[134]}]
set_input_delay -clock clk  0  [get_ports {biases[133]}]
set_input_delay -clock clk  0  [get_ports {biases[132]}]
set_input_delay -clock clk  0  [get_ports {biases[131]}]
set_input_delay -clock clk  0  [get_ports {biases[130]}]
set_input_delay -clock clk  0  [get_ports {biases[129]}]
set_input_delay -clock clk  0  [get_ports {biases[128]}]
set_input_delay -clock clk  0  [get_ports {biases[127]}]
set_input_delay -clock clk  0  [get_ports {biases[126]}]
set_input_delay -clock clk  0  [get_ports {biases[125]}]
set_input_delay -clock clk  0  [get_ports {biases[124]}]
set_input_delay -clock clk  0  [get_ports {biases[123]}]
set_input_delay -clock clk  0  [get_ports {biases[122]}]
set_input_delay -clock clk  0  [get_ports {biases[121]}]
set_input_delay -clock clk  0  [get_ports {biases[120]}]
set_input_delay -clock clk  0  [get_ports {biases[119]}]
set_input_delay -clock clk  0  [get_ports {biases[118]}]
set_input_delay -clock clk  0  [get_ports {biases[117]}]
set_input_delay -clock clk  0  [get_ports {biases[116]}]
set_input_delay -clock clk  0  [get_ports {biases[115]}]
set_input_delay -clock clk  0  [get_ports {biases[114]}]
set_input_delay -clock clk  0  [get_ports {biases[113]}]
set_input_delay -clock clk  0  [get_ports {biases[112]}]
set_input_delay -clock clk  0  [get_ports {biases[111]}]
set_input_delay -clock clk  0  [get_ports {biases[110]}]
set_input_delay -clock clk  0  [get_ports {biases[109]}]
set_input_delay -clock clk  0  [get_ports {biases[108]}]
set_input_delay -clock clk  0  [get_ports {biases[107]}]
set_input_delay -clock clk  0  [get_ports {biases[106]}]
set_input_delay -clock clk  0  [get_ports {biases[105]}]
set_input_delay -clock clk  0  [get_ports {biases[104]}]
set_input_delay -clock clk  0  [get_ports {biases[103]}]
set_input_delay -clock clk  0  [get_ports {biases[102]}]
set_input_delay -clock clk  0  [get_ports {biases[101]}]
set_input_delay -clock clk  0  [get_ports {biases[100]}]
set_input_delay -clock clk  0  [get_ports {biases[99]}]
set_input_delay -clock clk  0  [get_ports {biases[98]}]
set_input_delay -clock clk  0  [get_ports {biases[97]}]
set_input_delay -clock clk  0  [get_ports {biases[96]}]
set_input_delay -clock clk  0  [get_ports {biases[95]}]
set_input_delay -clock clk  0  [get_ports {biases[94]}]
set_input_delay -clock clk  0  [get_ports {biases[93]}]
set_input_delay -clock clk  0  [get_ports {biases[92]}]
set_input_delay -clock clk  0  [get_ports {biases[91]}]
set_input_delay -clock clk  0  [get_ports {biases[90]}]
set_input_delay -clock clk  0  [get_ports {biases[89]}]
set_input_delay -clock clk  0  [get_ports {biases[88]}]
set_input_delay -clock clk  0  [get_ports {biases[87]}]
set_input_delay -clock clk  0  [get_ports {biases[86]}]
set_input_delay -clock clk  0  [get_ports {biases[85]}]
set_input_delay -clock clk  0  [get_ports {biases[84]}]
set_input_delay -clock clk  0  [get_ports {biases[83]}]
set_input_delay -clock clk  0  [get_ports {biases[82]}]
set_input_delay -clock clk  0  [get_ports {biases[81]}]
set_input_delay -clock clk  0  [get_ports {biases[80]}]
set_input_delay -clock clk  0  [get_ports {biases[79]}]
set_input_delay -clock clk  0  [get_ports {biases[78]}]
set_input_delay -clock clk  0  [get_ports {biases[77]}]
set_input_delay -clock clk  0  [get_ports {biases[76]}]
set_input_delay -clock clk  0  [get_ports {biases[75]}]
set_input_delay -clock clk  0  [get_ports {biases[74]}]
set_input_delay -clock clk  0  [get_ports {biases[73]}]
set_input_delay -clock clk  0  [get_ports {biases[72]}]
set_input_delay -clock clk  0  [get_ports {biases[71]}]
set_input_delay -clock clk  0  [get_ports {biases[70]}]
set_input_delay -clock clk  0  [get_ports {biases[69]}]
set_input_delay -clock clk  0  [get_ports {biases[68]}]
set_input_delay -clock clk  0  [get_ports {biases[67]}]
set_input_delay -clock clk  0  [get_ports {biases[66]}]
set_input_delay -clock clk  0  [get_ports {biases[65]}]
set_input_delay -clock clk  0  [get_ports {biases[64]}]
set_input_delay -clock clk  0  [get_ports {biases[63]}]
set_input_delay -clock clk  0  [get_ports {biases[62]}]
set_input_delay -clock clk  0  [get_ports {biases[61]}]
set_input_delay -clock clk  0  [get_ports {biases[60]}]
set_input_delay -clock clk  0  [get_ports {biases[59]}]
set_input_delay -clock clk  0  [get_ports {biases[58]}]
set_input_delay -clock clk  0  [get_ports {biases[57]}]
set_input_delay -clock clk  0  [get_ports {biases[56]}]
set_input_delay -clock clk  0  [get_ports {biases[55]}]
set_input_delay -clock clk  0  [get_ports {biases[54]}]
set_input_delay -clock clk  0  [get_ports {biases[53]}]
set_input_delay -clock clk  0  [get_ports {biases[52]}]
set_input_delay -clock clk  0  [get_ports {biases[51]}]
set_input_delay -clock clk  0  [get_ports {biases[50]}]
set_input_delay -clock clk  0  [get_ports {biases[49]}]
set_input_delay -clock clk  0  [get_ports {biases[48]}]
set_input_delay -clock clk  0  [get_ports {biases[47]}]
set_input_delay -clock clk  0  [get_ports {biases[46]}]
set_input_delay -clock clk  0  [get_ports {biases[45]}]
set_input_delay -clock clk  0  [get_ports {biases[44]}]
set_input_delay -clock clk  0  [get_ports {biases[43]}]
set_input_delay -clock clk  0  [get_ports {biases[42]}]
set_input_delay -clock clk  0  [get_ports {biases[41]}]
set_input_delay -clock clk  0  [get_ports {biases[40]}]
set_input_delay -clock clk  0  [get_ports {biases[39]}]
set_input_delay -clock clk  0  [get_ports {biases[38]}]
set_input_delay -clock clk  0  [get_ports {biases[37]}]
set_input_delay -clock clk  0  [get_ports {biases[36]}]
set_input_delay -clock clk  0  [get_ports {biases[35]}]
set_input_delay -clock clk  0  [get_ports {biases[34]}]
set_input_delay -clock clk  0  [get_ports {biases[33]}]
set_input_delay -clock clk  0  [get_ports {biases[32]}]
set_input_delay -clock clk  0  [get_ports {biases[31]}]
set_input_delay -clock clk  0  [get_ports {biases[30]}]
set_input_delay -clock clk  0  [get_ports {biases[29]}]
set_input_delay -clock clk  0  [get_ports {biases[28]}]
set_input_delay -clock clk  0  [get_ports {biases[27]}]
set_input_delay -clock clk  0  [get_ports {biases[26]}]
set_input_delay -clock clk  0  [get_ports {biases[25]}]
set_input_delay -clock clk  0  [get_ports {biases[24]}]
set_input_delay -clock clk  0  [get_ports {biases[23]}]
set_input_delay -clock clk  0  [get_ports {biases[22]}]
set_input_delay -clock clk  0  [get_ports {biases[21]}]
set_input_delay -clock clk  0  [get_ports {biases[20]}]
set_input_delay -clock clk  0  [get_ports {biases[19]}]
set_input_delay -clock clk  0  [get_ports {biases[18]}]
set_input_delay -clock clk  0  [get_ports {biases[17]}]
set_input_delay -clock clk  0  [get_ports {biases[16]}]
set_input_delay -clock clk  0  [get_ports {biases[15]}]
set_input_delay -clock clk  0  [get_ports {biases[14]}]
set_input_delay -clock clk  0  [get_ports {biases[13]}]
set_input_delay -clock clk  0  [get_ports {biases[12]}]
set_input_delay -clock clk  0  [get_ports {biases[11]}]
set_input_delay -clock clk  0  [get_ports {biases[10]}]
set_input_delay -clock clk  0  [get_ports {biases[9]}]
set_input_delay -clock clk  0  [get_ports {biases[8]}]
set_input_delay -clock clk  0  [get_ports {biases[7]}]
set_input_delay -clock clk  0  [get_ports {biases[6]}]
set_input_delay -clock clk  0  [get_ports {biases[5]}]
set_input_delay -clock clk  0  [get_ports {biases[4]}]
set_input_delay -clock clk  0  [get_ports {biases[3]}]
set_input_delay -clock clk  0  [get_ports {biases[2]}]
set_input_delay -clock clk  0  [get_ports {biases[1]}]
set_input_delay -clock clk  0  [get_ports {biases[0]}]
set_output_delay -clock clk  0  [get_ports {out[3]}]
set_output_delay -clock clk  0  [get_ports {out[2]}]
set_output_delay -clock clk  0  [get_ports {out[1]}]
set_output_delay -clock clk  0  [get_ports {out[0]}]
